[
  {
    "title": "Java Fruit & Shake Vending Machine",
    "imageSrc": "projects/vendingmachine.png",
    "description": "A vending machine applicationdeveloped with features such as purchasing items, restocking inventory, adding new items, and an integrated graphical user interface (GUI).",
    "skills": ["Java", "JavaSwing"],
    "source": "https://github.com/Shioxri/CCPROG3-Machine-Project"
  },
  {
    "title": "Anime Forum Website - Fanime",
    "imageSrc": "projects/fanime.png",
    "description": "Fanime is a completed anime forum website where users can explore, discuss, and vote on anime-related posts. Registered users can interact, create and edit profiles, search posts by tags, and participate in discussions through posts, comments, and voting, ensuring a user-friendly and engaging experience.",
    "skills": ["HTML", "CSS", "JavaScript", "jQuery", "Mongoose", "MongoDB Atlas", "Handlebars"],
    "source": "https://github.com/mark-edison-jim/Fanime"
  },
  {
    "title": "Ruby Payroll Application System",
    "imageSrc": "projects/rubyimg.png",
    "description": "The Weekly Payroll System, built in Ruby, simulates payroll management with features like letting users generate daily and weekly salary reports based on employee work hours and day types. It accurately calculates regular, night shift, and overtime pay.",
    "skills": ["Ruby"],
    "source": "https://github.com/Shioxri/CSADPRG-MP"
  },
  {
    "title": "Culinary Class/Training Management Database App",
    "imageSrc": "projects/sql.png",
    "description": "The Culinary Class/Training Management project involves creating a database application to manage records of attendance, trainees, mentors, and training programs, along with supporting transactions for enrollment and trainee evaluations, and generating reports on trainee evaluations and payment status. Each module and report is assigned to a specific group member for development.",
    "skills": ["SQL", "Java", "HTML", "CSS"],
    "source": "https://github.com/Shioxri/CCINFOM-DB-App"
  },
  {
    "title": "Java Sorting Algorithms",
    "imageSrc": "projects/javasort.png",
    "description": "This project involves implementing and comparing four distinct sorting algorithms: Insertion Sort, Selection Sort, Merge Sort, and Quick Sort. It aims to analyze their performance using a sizable dataset by measuring and comparing their respective sorting times.",
    "skills": ["Java"],
    "source": "https://github.com/Shioxri/CCDSALG-MCO1"
  },
  {
    "title": "Java Social Connection Graphs",
    "imageSrc": "projects/javagraphs.png",
    "description": "This project explores the social graph structure of Facebook networks from American colleges, using a dataset of 34,216 account IDs across five institutions.  A Java program was developed to identify account connections efficiently by utilizing a Hashmap for data storage and retrieval, and a Breadth-First Search (BFS) algorithm for traversing connections. ",
    "skills": ["Java"],
    "source": "https://github.com/Shioxri/CCDSALG-MCO2"
  },
  {
    "title": "Simple Python Budget App",
    "imageSrc": "projects/pypypy.png",
    "description": "A simple budgeting app where I wanted to test and learn the basics of Python",
    "skills": ["Python"],
    "source": "https://github.com/Shioxri/Simple-Python-Budgeting-App"
  }
]
